using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;
using System.Drawing.Drawing2D;
using System.Runtime.InteropServices;
using System.Reflection;

namespace ElectronicSchoolSql
{
    public partial class frmr : Form
    {
        public frmr()
        {
            InitializeComponent();
        }

        //________________  
        [DllImport("user32.dll")]
        static extern int ReleaseCapture();
        [DllImport("user32.dll", EntryPoint = "SendMessageA")]
        static extern int SendMessage(int hwnd, int wMsg, int wParam, object lParam);
        private const int WM_NCLBUTTONDOWN = 161;
        private static Image fill_layer(PictureBox Pic_Box, Image img, Color Layer_color, int Percent)
        {
            Pic_Box.Image = img;
            Bitmap bmp_img = new Bitmap(Pic_Box.Image);
            Graphics ghp = Graphics.FromImage(bmp_img);
            LinearGradientBrush LineaBrush;
            LineaBrush = new LinearGradientBrush(new Rectangle(0, 0, bmp_img.Width, bmp_img.Height), Color.FromArgb(Percent, Layer_color), Color.FromArgb(Percent, Layer_color), LinearGradientMode.BackwardDiagonal);
            ghp.FillRectangle(LineaBrush, new Rectangle(0, 0, bmp_img.Width, bmp_img.Height));
            return (Image)bmp_img;
        }
       
        public static string[] GetCompletionList(string prefixText, int count, string contextKey)
        {
            // Create array of movies  
            string[] movies = { "Star Wars", "Star Trek", "Superman", "Memento", "Shrek", "Shrek II" };

            // Return matching movies  
            return (from m in movies where m.StartsWith(prefixText, StringComparison.CurrentCultureIgnoreCase) select m).Take(count).ToArray();
        }  
        const string farsistr = "دانش آموزان عزیز\n خوبید";
        const string ordibeheshtstr = "مشخصات كلي متولدين اردبيهشت ماه:\nخيلي قانع ، صبور و آرام ، پرتحمّل ، عاشق مالكيّت ، حسود ، متعصّب ، اهل اعتدال ، با محبّت ، خيلي قوي و سالم ، عاشق عطر و بوي طبيعي ، از تجارب گذشته الهام ميگيرد ، واقعاْ وفادار ، مخالف افراط ، ‎‎‎با سليقه ، خوشگلپسند ، پولدوست ، هميشه راضي ، مصمّم ، پركار ، سخاوتمند ،  مؤقّر و سنگين ، فقط در مقابل حرف آرام رام ميشود ، اهل ماديّات ، دنبال زندگي شيرين ، مادّيگرا و سودجو ، بههر كاري صورت واقعي ميدهد ، مخالف خشونت ، با ثبات و پايدار ، عاشق صلح و آرامش ، صادق ، مال جمع كن ، اهل هنر ، مخالف درگيري ، اگر عصباني شود طوفان بپا ميكند ، مستعد كشاورزي ، هركاري را به پايان ميرساند ، رئيس فعّال و لايق ، با همه كنار مي آيد ، خود سر ، نجيب، عاشق خانه و خانواده ، عاشق طبيعت ، عاشق رفتار ملايم ، كمك رسان ، داراي قلبي بزرگ ، با صفا ، مسلّط به نفس ، داراي عزّت نفس ، عاشق گل و زيبائي ، بي تفاوت نسبت به دشمنان ، ميانه رو ، رفيق و دوست بسيار شيرين ،شيك پوش ، علاقهمند به موسيقي ، قدر شناس ، مخالف عجله ، داراي تحمّل زياد ، محتاط و مخالف اعتراض و انتقاد .\nمرد متولد ارديبهشت:\n دير ناراحت ميشود اما اگر ناراحت شود دنيا را بههم ميريزد. زن شوخ، سياستمدار، مطيع و خانهدار را به حد پرستش دوست دارد. آرام، اهل عمل، حساس، محتاط است ولي اصلا رويائي نيست. زود رنج و بد خشم است اما هرگز از خانهاش قهر نميكند. دست و دلباز اما حسابگر است و علاقهمند است پسر داشته باشد.\nزن متولد ارديبهشت:\nطبيعت را دوست دارد. مادري سختگير، همسري فداكار و كمك دهنده، عاشق موسيقي و ساز و آواز است. از بسياري جهات نمك رندگي محسوب ميشود. دغلباز و ناپاك و اهل فلسفه بافي نيست. در عشق بيپرواست. در شيكپوشي طرفدار سادگي است، مخالف شتابزدگي است و يك رگ لجبازي دارد.";
        const string khordadstr = "مشخصات كلي متولدين خرداد ماه:\nاهل تنّوع ، واقعاْ باهوش ، سريعالانتقال ، متلّونالمزاج ، غير پايدار ، عاشق كارهاي فكري ، كنجكاو ، پرانرژي ، داراي شخصيّت دوتايي ، بيثبات ، دمدمي مزاج ، هرگز كار را تمام نميكند ، عاشق مسافرت ، معاشرتي ، سر به هوا ، زرنگ ، قابل تطبيق با هر محيط ، پي به اسرار ميبرد ، نا آرام ، در جستجوي مطالب جديد ، واقعاْ با سليقه ، ماهر ، داراي قدرت فكري زياد ، آدم شناس ، عاشق برنامههاي كوتاهمدت ، منطقي ، عاشق حركت ، متنفّر از تقلّب ، عاشق كامپيوتر ، از كار طولاني خسته ميشود، عاشق شطرنج ، زود جوش ، در يكجا بند نميشود ، نرم و غيرمستقيم حرف ميزند ، قابل انعطاف ، عاشق مطالعه ، عاشق جمع مردم  ، رنگارنگ ، داراي قوّه تخيّل زياد ، خوش سر و زبان ، ماجراجو و بي ثبات ، شيك پوش ، غير حسود ، گاهي شاد و گاهي غمگين ، گاهي پر حرف و گاهي خاموش ، نكته سنج ، اهل هنر ، خواهان وفاداري ، كم حرف ، آب زير كاه ، اهل معاشرت ، رويائي ، بي قرار ، اصلاْ رويش حساب نكنيد ، ميل ندارد كسي از كارش سر در بيارد ، با انصاف ، بدقول ، اهل زخم زبان ، گاهي لجباز ، عاشق غذاهاي تند .   \nمرد متولد خرداد:\nبا ذوق، هنر دوست، غير حسود و كمي بدقول، براي فرزندان پدري نرم و مهربان، در زناشوئي و معاشرت با زن اهل تنوع و ماجرا، خوش صحبت است، علاقه دارد كه مرموز جلوه كند، گاهي اهل زخم زبان، كنايه و آزار است. از شنيدن انتقاد از رفتار عاشقانهاش بيزار است.\nزن متولد خرداد:\nزني با چند شخصيت گوناگون، با قوه تخيل بالا، خوش سر و زبان و با سليقه، ماجرا دوست و بيثبات، خيلي بيش از اينكه طالب عصبانيت شما باشد به شفقت شما نياز دارد. عاشق تغيير و تحول است. مادري است شاد و خندان و بچههايش مانند خودش خود مختارند و روي پاي خود ميايستند.";
        const string tirstr = "مشخصات كلي متولدين تيرماه:\nخيلي حساس ، سريع الانتقال ، رويايي ، عاشق خانه و خانواده ، منزوي ، عاشق مهتاب ، عاشق فرزند ، علاقه مند به كشاورزي ، گاهي آرام و گاهي طوفاني ، خجالتي ، بسيار با سليقه و شيك پوش ، پشتيبان اقوام ، داراي قويترين احساسات ، بهترين آشپز ، علاقه زياد به گل ،  داراي حس پدرانه يا مادرانه ، با وفا ، رفيق باز ، صرفه جو و اقتصادي ، محتاج به كمك ديگران ، پر محبّت ، مطيع همسر ، تا حدودي خسيس ، متنفّر از انتقاد ، با هوش ، اهل قهر و آشتي ، در آشتي پيشقدم نمي شود ، همسري با وفا ، غمگين در روزهاي ابري ، گاهي خوب و گاهي بد ، خيالاتي ، عاشق عتيقه و اشياء كهنه ، اهل تدارك و آذوقه ، ماديّگرا و پول پرست ، رك گو ، خودخواه ومغرور ، تا حدودي سطحي نگر ، صبور و آرام ، حافظ اسرار ، علاقه زياد به مادر ، عاشق تعريف و تمجيد ، مهمان نواز عالي . خيلي ظريف ، شكيبا ، صميمي ، محافظه كار ، اهل ريسك نيست ، ميهن پرست ، انتقامجو ، وسواسي ، رئوف و مهربان .\nمرد متولد تير:\n	اخمو، بچه مسلك، تودار، همبازي بچهها، كمي بخيل و پول دوست، او بدون شك استاد است و ميتواند طولانيترين مطالب را در كوتاهترين جملات بيان كند. حواسش هرگز پرت نميشود و از پرچانگي بيزار است. اگر قلبش جريحه دار شود فورا به لاك خويش فرو ميرود. هيچ مردي به اندازه او زنش را دوست ندارد.\nزن متولد تير:\nبا وفا، نجيب، گاهي اوقات خسيس، در آشپزي قابل، در شبهاي مهتابي عاشق، در دوران مادري يك زن كمنظير، از انتقاد نفرت دارد، اگر مورد تمسخر قرار گيرد به شدت آزرده خاطر ميگردد و تاب تحمل طرد شدن را ندارد. صبر و از خودگذشتگي او براي كسانيكه دوستشان دارد حد و مرزي ندارد.";
        const string mordadstr = "مشخصات كلي متولدين مرداد ماه: \n پر محبّت ، متنفّر از دروغ ، واقعاْ قدرتمند ، ثابت قدم ، عاشق شهرت ، بسيار مغرور ، سر حال و بشّاش ، خودخواه و جاه طلب ، بد پيله ، خود بزرگ بين ، مقتدر ، مؤدّب ، فعّال و كوشا ، با ثبات و پايدار ، قوي و با اراده ، اهل معنويّات ، خود نما ، عاشق تعريف و تمجيد ، با جرأت و شهامت ، رهبر و فرمانروا ، زود گول مي خورد ، پر انرژي ، بلند نظر ، صدّيق و مهربان ، سخاوتمند ، وفادار ، شجاع ، علاقه مند به زندگي تجمّلي ،  لجوج ، حساس ، پر توقّع ، پر تحمّل ، دوستِ واقعي ، يك پدر نمونه ، بي ريا ، رام شونده ، داراي خشمي طوفاني ، مدافع و پشتيبان اطرافيان ، علاقه مند به موسيقي ، بايد مورد ستايش قرار گيرد ،  كمي حسود ، كار آمد ، دست و دلباز و تا حدودي ولخرج ، با گذشت ولي خودخواه ، بدون كينه ، فاقد بد ذاتي ، خون گرم ، ظريف كار ، سريع الانتقال ، خوش سيما و شكيل ، هميشه تميز ، يك دفعه و ناگهاني عصباني ميشود ، بسيار مؤدب و مورد احترام مردم.\nمرد  مرداد:\nيك شير ژيان و سر كش، يك عاشق پاكباز، يك دوست واقعي و يك پدر نمونه، بي عشق نميتواند زندگي كند دل او از آئينه پاكتر و روشنتر است اما خشم او هم توفاني هم سهمگين خواهد بود. اغلب آدمهاي كارآمدي هستند به نحوي كه اغلب كارهاي منزل را شخصا و با مهارت تمتم انجام ميدهند. \nزن متولد مرداد:\nباهوش، گرم و جذاب، شيك پوش، با شخصيت، خواهان تجمل، رياست طلب، دوستدار تعريف و تمجيد و كدبانو، در دوستان تاثير بسيار مطلوب بر جاي ميگذارد. مادري مهربان و صميمي كه ميكوشدفرزندان خود را مستقل و داراي اعتماد به نفس بار بياورد.";
        const string shahrivarstr = "مشخصات كلي متولدين شهريورماه: \n حساس ، با هوش ، شاد و سر حال ، دقيق ، وظيفه شناس ، خوش هيكل و خوش تيپ ، سالم و تندرست ، اهل سازش ، سود جو ، خجول ، بد پيله ، واقعاْ ساعي و كوشا ، سرمايه دار ، كمال گرا ، صبور و آرام ، عاشق سلامت خود  ، متّكي به نفس ، خونسرد و خوددار ، عاشق كامپيوتر ، روشنفكر و دانشمند ، قابل  انعطاف ، وسواسي ، پر انرژي ، مبتكر ، اهل اعتدال و ميانه روي ، كمك رسان ، اهل انتقاد ، معتمد ، وفادار ، با ايمان ، رام نشدني ، بي ريا و بي تزوير ، خوش قلب ، چشم و گوش بسته ، با شرم و حيا ، ثابت قدم ، مورد حسد قرار مي گيرد ، دور از جرّ و بحث ، گول زرق و برق را نمي خورد ، فرشته خو ، خيلي درس خوان ، چابك ، خيال پرداز ، داراي ذائقه قوي ، با انضباط و مستقل ، كاردان و لايق ، نكته سنج ، خود كفا ، پر توقّع ، اهل همدردي ، زود رنج ، قاطع ، دور انديش ، خرده گير و خورده بين .\nمرد متولد شهريور:\n	آتش عشق اين مرد بسيار كم شعله اما جاودانه و با حرارت است. مجموعهاي است از كمال و هوش و ثبات قدم. بر انگيختن احساساتش كار دشواري است. او ميتواند سالهاي سال بدون اينكه قلبش براي كسي بتپد زندگي كند. به كوچكترين چيزهائي كه مورد علاقه همسرش است فكر ميكند و به آنها اهميت ميدهد.\nزن متولد شهريور:\nبسيار احساساتي، بيريا و تزوير، خوش قلب، خواستار عشق حقيقي و وفادار به همسر و خانواده، در مناسبات خود با او سعي كنيد از جر و بحث پرهيز نمائيد. در هيچ كاري زيادهروي نميكند و خوب ميتواند از خود مراقبت كند. در مقابل اقرار به گناهان خويش سرسختي عجيبي نشان ميدهد.";
        const string mehrstr = "مشخصات كلي متولدين مهر ماه: \n اهل اعتدال ، حامي وپشتيبان همسر ، شيرين بيان ، صلح جو ، علاقه مند به فضا ، آرام و متين ، بسيار منطقي ، بي آلايش ، عاشق اصالت ، علاقه مند به موسيقي ، اجتماعي ، مؤقّر ، بد پيله ، خجالتي ، پر از احساس ، اهل مشورت ، عاشق هنر و ادبيات ، سياستمدار ، به فكر فردا نيست ، مقبول اطرافيان ، اهل مساوات و برابري ، پر شور و حرارت نيست ، عاقل ، اهل حمايت از ديگران ، معتدل و پايدار ، شكمو ، اميدوار ، با انصاف ،خوش سليقه ، اهل تجزيه و تحليل ، گاهي تنبل ، كنجكاو و جستجو گر ، متنفّر از زيادي مهمان ، انتقامجو ، از بي بند و باري متنفّر است ، با معلومات و با درايت ، به آساني تغيير عقيده نمي دهد ، مهربان ، شيك پوش و جذّاب ، نكته سنج ، داراي پشتكار فراوان ، يك روز گرم و يك روز سرد ، هوشمند ، مشاور خوب ، دوست ياب ، منظّم و مرتّب ،عاشق رنگ آبي ، گاهي لجباز ، مثل باتري بايد مرتّب شارژ شود ، صادق و درستكار ، خوش مشرب ، ساده دل ، آسان گير ، دو دل و مردد ، خوشبين .\nمرد متولد مهر:\nبا انصاف، متعادل، زن پرست، خوش سليقه و گاه تنبل و بي اعتنا نسبت به زندگي، اگر شوهر متولد مهر داريد هميشه به سر و وضع خود برسيد خانه را تميز و مرتب نگاه داريد. اين مرد به هيچ وجه مايل به رنجاندن ديگران نيست. شما ميتوانيد به خود بباليد كه هوشمندترين مشاور جهان را د رجوار خود داريد. \nزن متولد مهر:\nمعمولا استخوان بندي درشتي دارد و نسبتا سنگين وزن است. شما بارها در او علائم ياز قدرت، اراده، جديت و تصميم ميبيند كه با خلق و خوي زنانه كمتر سازگاري دارد. در هر موقعيتي چه جزئي و چه مهم هوشياري و انصاف و قدرت استدلال خود را ظاهر ميسازد و از انزوا و تنهائي نفرت دارد.";
        const string abanstr = "مشخصات كلي متولدين آبان ماه: \n قوي و قدرتمند ، مصمّم و با اراده پولادين ، ورزشكار ، هوشيار ، حسّاس و خجول ، در ظاهر آرام ولي در باطن خروشان ، انتقامجوي شديد ، پر انرژي ، واقعاْ كوشا ، عاشق ماورالطبيعه ، اهل معنويّات ، عاشق مسائل مرموز ، هر كاري را به پايان مي رساند ، مشكوك و كنجكاو و تودار ، مجري بسيار خوب ، پايدار و با ثبات ، محقّق ورزيده ، كاشف و دانشمند ، علاقه مند به تفتيش عقايد ، فكر سايرين را مي خواند ، داراي روح قوي ، واقعاْ اميدوار ، فرمانده و سياستمدار ، مقاوم و پر تحمّل ، فنا ناپذير ، عدّه كمي را وارد زندگي خود مي كند ، عاشق تولّد مجدّد ، داراي اهداف عالي ، بلند پرواز ، علاقهمند به روانكاوي و روانشناسي ، پر شور و حرارت ، پدري فداكار ، عاشق نصيحت كردن ديگران ، داراي افكار تخيّلي و ايده آل ، زيبا ، حسود ، موقع شناس ، جاه طلب ، خشن ، قابل اعتماد ، متنفّر از دروغ ، با وقار ، منطقي ، ماجراجو ، عاشق اسرار حيات و جهان ، با اعتماد به نفس ، شجاع و دلير ، كمال گرا ، اهل معنويّات و واقعاْ قاطعانه عمل مي كند .\nمرد متولد آبان:\nتيز هوش، با اراده، خواستار هدفهاي بزرگ، پدري دلسوز و مهربان، مواظب باشيد كه هرگز به مرد متولد اين ماه دروغ نگوئيد و احساسات او را جريحه دار نكنيد و يا بر خلاف غرور مردانه او رفتار و گفتاري نداشته باشيد زيرا كه انتقام و عكس العمل خشمگينانه او بسيار سوزنده و خطرناك است.\nزن متولد آبان:\nطناز و زيبا، خانه دار و گرم، حسود و انتقامجو، راز دار و خود دار، موقع شناس و گاه جاه طلب، جذاب و مغرور و با اعتماد به نفس، براي متولد اين ماه اندكي علاقه و يا اندكي تنفر مفهوم ندارد يا عاشق است يا دشمن و در غير اينصورت كاملا بي تفاوت و بي اعتناست.";
        const string azarstr = "مشخصات كلي متولدين آذرماه: \n پر شانسترين فرد ، ساده و بي آلايش ، عاشق تعليم و تربيت ، سازشكار ، با هوش و با نشاط ، اهل دين و مذهب و معنويّات ، كنجكاو ، خوش قلب ، دوست داشتني ، علاقهمند به مسافرت و گردش ، اجتماعي و خوش مشرب ، اهل تجربه ، سخاوتمند ، با ذوق ، چالاك ، يك دفعه حرف شيرين مي پراند ، انعطاف پذير ،  فراموشكار ، اهل عدالت ، مشتاق و پر انرژي ، زود خسته مي شود ، علاقهمند به معاشرت و دوست يابي ، مرتّب كار عوض مي كند ، عاشق تنوّع ، شاد و خندان ، با شهامت ، پاك و معصوم ، دعوائي و زودرنج ، اهل فرار از مسئوليّت ، خوش ذات ، صادق ، كم دقّت ، خوش بين ، منطقي ، مهمان دوست ، ولخرج ، رك گو ، اهل سؤال و جواب ، دمدمي مزاج ، براي دوست هر كاري مي كند ، عاشق شهرت و افتخار ، خونگرم ، با معلومات ، سريع الانتقال و باهوش ، خوش گذران ، چيز فهم ، مشتاق بيان حقايق .\nمرد متولد آذر:\nصادق و راستگو، دمدمي مزاج، در عشق كم اعتنا، خواهان آزادي و بيقيدي و طرفدار تنوع و مسافرت، خطرناكترين شوهر دنيا است. صاحب بزركترين كلكسيون دوست  آشنا در دنياست، به هنگام انتخاب دوست به  جاي توجه به ظاهر دقت خود را متوجه باطن آنها ميسازد.\nزن متولد آذر:\nاهل منطق و واقعيت، مهمان دوست، بي ريا و پول خرج كن، بي نظم و انضباط، راستگو اما بد زبان و درشتگو، زبان متولد اين ماه نيشدار و پر كنايه است اما قلبش پاك و صميمي و بي ريا ست. بيشتر اهل شكار افتخارات و شهرت است تا اهل شكار و پول و ماديات.";
        const string deystr = "مشخصات كلي متولدين دي ماه:\nداراي شخصيّت عالي ، خيلي لايق و كاردان ، بهترين رئيس ، انتقامجوي شديد   ، ساده پوش و بي آلايش ، محتاط  ، آرام و صبور ، مرد عمل  ، مقتدر  ، پر تحمّل ،  جدّي و جاه طلب ، فعّال و كوشا ، واقع بين ، سركش ، پول دوست ، بيهوده انرژي تلف نمي كند ، از تجربيّات خود و ديگران به خوبي استفاده مي كند ، باشرف و با وجدان ، تميز ، خودكفا و سودجو ، داراي حس مسئوليّت زياد ، دشمن ولخرجي و اسراف ، حسابگر ، مخالف تجمّلات ، صاحب شأن و مقام ، سازمان دهنده خوب ، تقريباْ سياستمدار ، كوشا و مطمئن و خونسرد ، تودار ، مالك همسر خود ، حسود و بدبين ، متنفّر از طلاق ، داراي عدم اعتماد به نفس كافي ، قدرت طلب ، خانواده دوست ، خشك ولي مهربان ، خشن ، داراي زبان نيشدار ، شاد و با نشاط ، داراي باطن خروشان ، غير قابل گذشت ، قدر شناس ، گاهي اوقات خجالتي ، باانضباط ، بد اخم و بد عنق ، داراي حافظه قوي ، زود سر كار مي آيد و دير مي رود ، از تنبلي بيزار است ، اهل دكتر و دارو ، خونسرد و مداوم ، ثابت قدم ، خودكار ، مذهبي ، شنونده خوب و گاهي اوقات لجباز .\nمرد متولد دي:\nقدرت طلب، خانواده دوست، خوددار و سرد، در عرصه عشق كم حرف و كم تظاهر، پدري جدي و خشك اما مهربان و دلسوز. مقام را به ثروت ترجيح ميدهد. در جواني بسيار جدي است ولي به تدريج كه پا به سن ميگذارد نرم ميشود. ابراز عشق و علاقه را بايد به وي ياد بدهيد.  مرد اين ماه  هرگز از روي هوس ازدواج نميكند.\nزن متولد دي:\nجاه طلب، كد بانو، منظم، كمي لجباز و زود رنج، هميشه آراسته و خوش لباس، هدف نهائي او هميشه تامين زندگي، جلب احترام و كسب اقتدار و برخورداري از موقعيتهاي چشمگير است. از نظر اجتماعي فوق العاده مبادي آداب و با نزاكت است.";
        const string bahmanstr = "مشخصات كلي متولدين بهمن ماه: \n بسيار حسّاس ،  استوار و ثابت قدم ، واقعاْ عاقل و تودار ، بدون ريا و تزوير ، انسان واقعاْ خوب ، دانا ، خونسرد ، رك گو ، روي خودش بيش از ديگران حساب مي كند ، مستقل ، منطقي ، عاشق بشريّت و انسانيّت ، فكر ديگران را ميخواند ، ثابت قدم ، آرامش دوست ، كمك رسان ، آسان زندگي مي كند ، پرسه زدن را دوست دارد ، داراي حسّ ششم قوي ، علاقه مند به دوستان ، آزاديخواه ، بلند پرواز ، رام نشدني ، هر جا برود بر مي گردد  ، جاه طلب ، از اقرار به گناه منزجر است  ، دوستان بسيار زيادي دارد ، رازدار و تو دار ، اجتماعي ، تا حدودي خودخواه و مغرور ، انتقاد را قبول ندارد ، فرشته خو ، از تعريف لذّت مي برد ، راه و روش خود را به طور دائم تغيير ميدهد ، منافع خود را به خاطر ديگران به خطر مي اندازد ، سخاوتمند مخصوصاْ در دوستي ، دوستي او عميق و شكوهمند است ، ولخرجيش از روي عقل است ، خوش قلب و مهربان ، كمحافظه ، بهترين مشاور ، پرحركت و بيقرار ، كم علاقه به اصول سنتّي و قدرشناس .\nمرد متولد بهمن:\nدارا دوستان زيادي است، از اقرار به نقطه ضعفهاي خود منزجر است. حسود و سوظني نيست، هارت و پورت و هياهو دارد. دير ازدواج ميكند و در بيماري وسواس است. ذاتآ اجتماعي است و افكاري را در سر ميپروراند كه اصلآ عملي نيستند. عشق اول خود را براي تمام عمر در خاطر نگه ميدارد.\nزن متولد بهمن:\nبسيار غافلگير كننده، سزيع الانتقال، دارادي حس پيش بيني، كنجكاو، رفيق باز و كم علاقه به آداب و رسوم، در عشق خود بسيار جدي و وفادار است اما قادر به ابراز آن نيست. او متعلق به همه جا همه كس است اما د رعين حال از آن هيچكس نميباشد.";
        const string esfandstr = "مشخصات كلي متولدين اسفند ماه: \n بسيار حسّاس و رؤيايي ، داراي حسّ ششم ، خيلي ظريف و نرم عمل ميكند ، اهل آرامش و ملايمت ، هميشه موافق ، سازشكار و داراي تخيّلات شديد ، اصلاْ واقع بين نيست ، سازگار ، زود رنگ عوض مي كند ، احساساتي ، قابل انعطاف ، داراي افكار غير واقعي و غير منطقي ، بسيار متين و آرام ، كم عصباني مي شود ، مهربان ، علاقه مند به موسيقي ، عاشق صلح و آرامش ، كم انرژي ، سادهلوح ، پول دوست ، مرموز ، داستانپرداز قوي ، نيكوكار  خجالتي ، خواستار تشويق و حمايت ، زود رنج ، از نظر جسمي ضعيف ، دو دل ، ترسو ، خيلي حسود ، باريك بين و دقيق ، خيالباف ، نا اميد ، اهل نامه نگاري ، علاقه زيادي به جشن تولّد ، يا منفي كامل است يا مثبت كامل ، داراي صبر ايّوب است ،  گاهي اوقات واهي و پوچ گرا ، نازنين ولي ناقلا ، اهل معنويّات ، به دخترانش علاقه زيادي دارد ، غمگرا ، خواستار نوازش ، احساس آرامش ميدهد .\nمرد متولد اسفند:\nبه هيچ عنوان حد وسط ندارد، يا منفي كامل است يا مثبت كامل، از كم كاري و خونسردي او نرنجيد، هفتهاي دو سه بار به او بگوئيد دوستش داريد. متعصب نيست و هرگز به قضاوت نمينشيند و تا زمانيكه به مطلبي پي نبرده باشد نظريهاي ابراز نميدارد.\nزن متولد اسفند:\nظرف عسلي است كه قدري فلفل به داخل آن ريخته شده است. از بسياري جهات بينظير است. ناراحتترين مردها در جوار زن اسفند احساس آرامش ميكنند. سخت رويائي و خيالباف است، به كودكان خويش عشق ميورزد.";
        string text = "";
        static int index = 0;
        private void timer1_Tick(object sender, EventArgs e)
        {
            if (text == "") return;
            label1.Text = text.Substring(0, index);
            index++;
            if (index == text.Length + 1)
            {
                index = 0;
                timer1.Enabled = false;
            }
        }
        private void frmr_Load(object sender, EventArgs e)
        {
            this.FormClosed += new FormClosedEventHandler(frmr_FormClosed);
            panel1.MouseDown += new MouseEventHandler(panel1_MouseDown);
            farsi.MouseHover += new EventHandler(farsi_MouseHover);
            farsi.MouseLeave += new EventHandler(farsi_MouseLeave);
            farsi.MouseMove += new MouseEventHandler(farsi_MouseMove);
            farsi.MouseMove += new MouseEventHandler(farsi_MouseMove);
            farsi.MouseUp += new MouseEventHandler(farsi_MouseUp);
            farsi.MouseDown += new MouseEventHandler(farsi_MouseDown);
        }

        private void frmr_FormClosed(object sender, FormClosedEventArgs e)
        {
            Application.Exit();
        }

        private void panel1_MouseDown(object sender, MouseEventArgs e)
        {
            ReleaseCapture();
            SendMessage(this.Handle.ToInt32(), WM_NCLBUTTONDOWN, 2, 0);
        }

        private void farsi_MouseDown(object sender, MouseEventArgs e)
        {
        /// farsi.Image = ElectronicSchoolSql.Properties.Resources.farsi_click;
        }

        private void farsi_MouseHover(object sender, EventArgs e)
        {
            text = "ریاضی";
            index = 0;
            timer1.Enabled = true;
        }
       

        private void farsi_MouseUp(object sender, MouseEventArgs e)
        {
            farsi.Image = null;
        }

        private void farsi_MouseMove(object sender, MouseEventArgs e)
        {
            //farsi.Image = ElectronicSchoolSql.Properties.Resources.farsi_hover;
        }

        private void farsi_MouseLeave(object sender, EventArgs e)
        {
            label1.Text = "ریاضی";
            text = "";
            farsi.Image = null;
        }
        void btn_Click(object sender, EventArgs e)
        {
            for (int i = 0; i < 10; i++)
            {
                Button btn = sender as Button;
                btn.Location = new Point(btn.Left + i, btn.Top);
                Application.DoEvents();
            }
        }

        private void menuStrip1_ItemClicked(object sender, ToolStripItemClickedEventArgs e)
        {

        }

        private void mnugho_Click(object sender, EventArgs e)
        {
            axShockwaveFlash1.Dispose();
            axShockwaveFlash1 = new AxShockwaveFlashObjects.AxShockwaveFlash();
            axShockwaveFlash1.Dock = DockStyle.Fill;
            panel1.Controls.Add(axShockwaveFlash1);
            axShockwaveFlash1.Movie = Application.StartupPath + @"..\..\..\Resources\Quran_paye_5\main.swf";
            
        }

        private void فارسیبخوانیمToolStripMenuItem_Click(object sender, EventArgs e)
        {

        }

        private void فارسیبنویسیمToolStripMenuItem_Click(object sender, EventArgs e)
        {

        }

        private void ریاضیToolStripMenuItem_Click(object sender, EventArgs e)
        {
            axShockwaveFlash1.Dispose();
            axShockwaveFlash1 = new AxShockwaveFlashObjects.AxShockwaveFlash();
            axShockwaveFlash1.Dock = DockStyle.Fill;
            panel1.Controls.Add(axShockwaveFlash1);
            axShockwaveFlash1.Movie = Application.StartupPath + @"..\..\..\Resources\riazi_paye_5\main.swf";
        }

        private void علومToolStripMenuItem_Click(object sender, EventArgs e)
        {
           axShockwaveFlash1.Dispose();
            axShockwaveFlash1 = new AxShockwaveFlashObjects.AxShockwaveFlash();
            axShockwaveFlash1.Dock = DockStyle.Fill;
            panel1.Controls.Add(axShockwaveFlash1);
            axShockwaveFlash1.Movie = Application.StartupPath + @"..\..\..\Resources\Olom_tajrobi_paye_5\main.swf"; 
        }

        private void تعلیماتاجتماعیToolStripMenuItem_Click(object sender, EventArgs e)
        {
axShockwaveFlash1.Dispose();
            axShockwaveFlash1 = new AxShockwaveFlashObjects.AxShockwaveFlash();
            axShockwaveFlash1.Dock = DockStyle.Fill;
            panel1.Controls.Add(axShockwaveFlash1);
            axShockwaveFlash1.Movie = Application.StartupPath + @"..\..\..\Resources\TalimatEjtemaee_paye_5\main.swf"; 
        }

        private void هدیههایآسمانیToolStripMenuItem_Click(object sender, EventArgs e)
        {
axShockwaveFlash1.Dispose();
            axShockwaveFlash1 = new AxShockwaveFlashObjects.AxShockwaveFlash();
            axShockwaveFlash1.Dock = DockStyle.Fill;
            panel1.Controls.Add(axShockwaveFlash1);
            axShockwaveFlash1.Movie = Application.StartupPath + @"..\..\..\Resources\Hadyeha_book_paye_5\main.swf"; 
        }

        private void هدیههایآسمانیکتابکارToolStripMenuItem_Click(object sender, EventArgs e)
        {
axShockwaveFlash1.Dispose();
            axShockwaveFlash1 = new AxShockwaveFlashObjects.AxShockwaveFlash();
            axShockwaveFlash1.Dock = DockStyle.Fill;
            panel1.Controls.Add(axShockwaveFlash1);
            axShockwaveFlash1.Movie = Application.StartupPath + @"..\..\..\Resources\Hadyeha_workbook_paye_5\main.swf"; 
        }
    }
}
